OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
        if (InChar == 27)
        {
            return InChar;
        }

        if (InChar == 'x' || InChar == 'X' || InChar == 'f' ||
                InChar == 'F' || InChar == 'r' || InChar == 'R')
        {
            return InChar;
        }

        if (InChar == '-')
        {
            InString[i] = InChar;
            printf("%c", InChar);
            i++;
        }
        else if ((InChar >= '0') && (InChar <= '9'))
        {
            InString[i] = InChar;
            printf("%c", InChar);
            i++;
        }
    }

    printf("\n");

    return atoi((const char *)InString);
}

/*
    * CCITT (0xFFFF)
    * mode: 0: calculate; 1: verify
*/
static uint16_t _Perform_CCITT(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    uint32_t i;
    uint16_t *pu16buf, u16OrgSum, u16CalSum;

    if (len > 56) // valid data byte count
        return -1;

    pu16buf = (uint16_t *)pu32buf;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_CCITT, 0, 0xFFFFul, CRC_CPU_WDATA_16);

    for (i = 1; i < (len / 2); i++)
        CRC_WRITE_DATA(pu16buf[i]);

    u16OrgSum = pu16buf[0];
    u16CalSum = CRC_GetChecksum();

    /* Clear CRC checksum and reset seed */
    CRC_SET_SEED(0xFFFF);

    if (mode == 0)
    {
        pu16buf[0] = u16CalSum;
        return u16CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CCITT checksum */
        if (u16OrgSum == u16CalSum)
            return 0;   /* Verify CCITT Pass */
        else
        {
            return -1;  /* Verify CCITT Fail */
        }
    }
    else
    {
        return -1;
    }
}

/*
    * CRC32
    * mode: 0: calculate; 1: verify
*/
static uint32_t _Perform_CRC32(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    uint16_t i;
    uint32_t u32OrgSum, u32CalSum;

    DBG("len: %d\n", len);

    if (len > 60) // valid data byte count
        return -1;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_32, (CRC_WDATA_RVS | CRC_CHECKSUM_COM | CRC_CHECKSUM_RVS), 0xFFFFFFFFul, CRC_CPU_WDATA_32);

    for (i = 0; i < (len / 4) - 1; i++)
    {
#if (0)
        DBG("idx-%d: 0x%08x. (CRC32)\n", i, pu32buf[i]);
#endif
        CRC_WRITE_DATA(pu32buf[i]);
    }

    u32OrgSum = pu32buf[i];
    u32CalSum = CRC_GetChecksum();

    /* Clear CRC checksum and reset seed */
    CRC_SET_SEED(0xFFFFFFFF);

    DBG("mode: %d\n", mode);

    if (mode == 0)
    {
        pu32buf[i] = u32CalSum;
        return u32CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CRC32 checksum */
        if (u32OrgSum == u32CalSum)
            return 0;   /* Verify CRC32 Pass */
        else
        {
            DBG("u32OrgSum: 0x%08X, u32CalSum: 0x%08X\n", u32OrgSum, u32CalSum);
            return -1;  /* Verify CRC32 Fail */
        }
    }
    else
    {
        return -1;
    }
}

//    //key = "a000000000000000000000000000000000000000000000000000000000000001"
//    //CRYPTO->AES0_KEY[0] = 0xa0000000;
//    //CRYPTO->AES0_KEY[1] = 0x00000000;
//    //CRYPTO->AES0_KEY[2] = 0x00000000;
//    //CRYPTO->AES0_KEY[3] = 0x00000000;
//    //CRYPTO->AES0_KEY[4] = 0x00000000;
//    //CRYPTO->AES0_KEY[5] = 0x00000000;
//    //CRYPTO->AES0_KEY[6] = 0x00000000;
//    //CRYPTO->AES0_KEY[7] = 0x00000001;
//
//    //iv = "1000000000000000000000000000000a"
//    //CRYPTO->AES0_IV[0] = 0x10000000;
//    //CRYPTO->AES0_IV[1] = 0x00000000;
//    //CRYPTO->AES0_IV[2] = 0x00000000;
//    //CRYPTO->AES0_IV[3] = 0x0000000a;
/**
  * @brief      Perform AES-256 CFB NoPadding encrypt
  */
static int32_t _AES256Encrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    int32_t i32TimeOutCnt;

    AES_CLR_INT_FLAG(CRYPTO);
    AES_Open(CRYPTO, 0, 1, AES_MODE_CFB, AES_KEY_SIZE_256, AES_IN_OUT_SWAP);
    AES_SetKey(CRYPTO, 0, KEY, 4 * 8);
    AES_SetInitVect(CRYPTO, 0, IV);
    AES_SetDMATransfer(CRYPTO, 0, (uint32_t)in, (uint32_t)out, len);
    AES_Start(CRYPTO, 0, CRYPTO_DMA_ONE_SHOT);

    i32TimeOutCnt = SystemCoreClock; /* > 1 second time-out */

    while (AES_GET_INT_FLAG(CRYPTO) == 0)
    {
        if (i32TimeOutCnt-- < 0)
            return -1;
    }

    if (AES_GET_INT_FLAG(CRYPTO) & CRYPTO_INTSTS_AESEIF_Msk)
    {
        AES_CLR_INT_FLAG(CRYPTO);
        return -2;
    }

    AES_CLR_INT_FLAG(CRYPTO);
    return 0;
}

/**
  * @brief      Perform AES-256 CFB NoPadding decrypt
  */
static int32_t _AES256Decrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    int32_t i32TimeOutCnt;

    AES_CLR_INT_FLAG(CRYPTO);
    AES_Open(CRYPTO, 0, 0, AES_MODE_CFB, AES_KEY_SIZE_256, AES_IN_OUT_SWAP);
    AES_SetKey(CRYPTO, 0, KEY, 4 * 8);
    AES_SetInitVect(CRYPTO, 0, IV);
    AES_SetDMATransfer(CRYPTO, 0, (uint32_t)in, (uint32_t)out, len);
    AES_Start(CRYPTO, 0, CRYPTO_DMA_ONE_SHOT);

    i32TimeOutCnt = SystemCoreClock; /* > 1 second time-out */

    while (AES_GET_INT_FLAG(CRYPTO) == 0)
    {
        if (i32TimeOutCnt-- < 0)
            return -1;
    }

    if (AES_GET_INT_FLAG(CRYPTO) & CRYPTO_INTSTS_AESEIF_Msk)
    {
        AES_CLR_INT_FLAG(CRYPTO);
        return -2;
    }

    AES_CLR_INT_FLAG(CRYPTO);
    return 0;
}

static int32_t _Perform_GenPacket(CMD_PACKET_T *pCMD)
{
    uint32_t    i;

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("Raw RSP data:\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif
    /* Generate CCITT */
    _Perform_CCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 0);

    for (i = 0; i < sizeof(g_ChipISPInfo.au32AESKey) / 4; i++)
    {
        if (g_ChipISPInfo.au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not encrypt the cmd data */
    if (i == 8)
    {
        DBG("\nDo not encrypt cmd data. \n");
    }
    else
    {
        if (_AES256Encrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), g_ChipISPInfo.au32AESKey, g_ChipISPInfo.au32AESIV) < 0)
        {
            return -1;
        }
    }

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("AES KEY:\n");

